using System;

namespace TaxiBus
{
    class Program
    {

        //Обеспечить контроль загрузки и готовности к отправлению автобусов и такси.
        //Водитель такси и автобуса имеют права разной категории.Без водителя машина не поедет.Два водителя в одну машину сесть не могут.
        //Без пассажиров машины не поедут.Есть лимит загрузки машин. Для автобуса 30 чел.Для такси -4 чел.
        //Рекомендуется для водителя применить паттерн синглтон.  

        static void Main(string[] args)
        {
            Console.WriteLine("Hello World!");


        }
    }
}
